read_verilog src/main/verilog/rv32_opcodes.vh
read_verilog src/main/verilog/vscale_alu_ops.vh
read_verilog src/main/verilog/vscale_csr_addr_map.vh
read_verilog src/main/verilog/vscale_ctrl_constants.vh
read_verilog src/main/verilog/vscale_hasti_constants.vh
read_verilog src/main/verilog/vscale_md_constants.vh
read_verilog src/main/verilog/vscale_multicore_constants.vh

read_verilog src/main/verilog/vscale_PC_mux.v
read_verilog src/main/verilog/vscale_alu.v
read_verilog src/main/verilog/vscale_arbiter.v
read_verilog src/main/verilog/vscale_core.v
read_verilog src/main/verilog/vscale_csr_file.v
read_verilog src/main/verilog/vscale_ctrl.v
read_verilog src/main/verilog/vscale_dp_hasti_sram.v
read_verilog src/main/verilog/vscale_hasti_bridge.v
read_verilog src/main/verilog/vscale_imm_gen.v
read_verilog src/main/verilog/vscale_mul_div.v
read_verilog src/main/verilog/vscale_pipeline.v
read_verilog src/main/verilog/vscale_regfile.v
read_verilog src/main/verilog/vscale_sim_top.v
read_verilog src/main/verilog/vscale_src_a_mux.v
read_verilog src/main/verilog/vscale_src_b_mux.v

hierarchy -top vscale_sim_top
hierarchy -check

proc; opt; fsm; opt; memory; opt
techmap; opt
clean

write_verilog -noattr mvscale_top_c2_mem.v